Дипломная/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВсеДлительностиОтпусков();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресДанных = АнализГрафикаНаСервере();
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("АдресДанных", АдресДанных);
    ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);
		
КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
    ДанныеДляАнализа = Новый Массив;
    ТабличнаяЧасть = Объект.ОтпускаСотрудников;
    
    Для Каждого Строка Из ТабличнаяЧасть Цикл
        Запись = Новый Структура("Сотрудник, ДатаНачала, ДатаОкончания");
        Запись.Сотрудник = Строка.Сотрудник;
        Запись.ДатаНачала = Строка.ДатаНачала;
        Запись.ДатаОкончания = Строка.ДатаОкончания;
        ДанныеДляАнализа.Добавить(Запись);
    КонецЦикла;
    
    АдресДанных = ПоместитьВоВременноеХранилище(ДанныеДляАнализа, УникальныйИдентификатор);
    
    Возврат АдресДанных;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОбновитьТекущуюДлительностьОтпуска();
	ИнициализироватьУсловноеОформление();
	ОбновитьВсеДлительностиОтпусков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьУсловноеОформление()
		
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();     
  
    ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();    
    ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников"); 
    ПолеОформления.Использование = Истина;
 
    ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников.Длительность");   
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;    	
	ЭлементОтбора.ПравоеЗначение = 28;
    ЭлементОтбора.Использование  = Истина;
 
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущуюДлительностьОтпуска()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
    Длительность = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала) / 86400 + 1;
    ТекущиеДанные.Длительность = Длительность;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсеДлительностиОтпусков()
	
	ТабличнаяЧасть = Объект.ОтпускаСотрудников;
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		
		Если Строка.ДатаНачала <> Неопределено И Строка.ДатаОкончания <> Неопределено Тогда
            Строка.Длительность = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
        Иначе
            Строка.Длительность = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
